; domain
(define (domain industrial_manufacturing)
	(:requirements
		:strips
		:typing
		:negative-preconditions
		:equality
		:adl
		:conditional-effects
		:existential-preconditions
		:universal-preconditions
	)

		(:types
		location
		work_station

		box
		supply
		durable

		valve bolt durable - supply
		tool - durable

		robotic_agent
	)

	(:constants
		warehouse - location
	)

	(:predicates
		(adjacent ?l1 - location ?l2 - location)
		(belong ?ws - work_station ?l - location)

		(assigned ?ws - work_station ?d - durable)
		(dissociate ?d - durable)

		(full ?b - box ?s - supply)
		(empty ?b - box)

		(loaded ?b - box ?r - robotic_agent)
		(unloaded ?b - box)

		(occupied ?r - robotic_agent ?b - box)
		(free ?r - robotic_agent)

		(at_box ?b - box ?l - location)
		(at_robot ?r - robotic_agent ?l - location)
		(at_supply ?s - supply ?l - location)

		(delivered ?s - supply ?ws - work_station)

		(is_durable ?d - durable)
	)

	; Moves a free robot between two locations, if it is not already there
	(:action move_free_robot
		:parameters (?r - robotic_agent ?from ?to - location)
		:precondition (and
			(not (= ?from ?to))
			(adjacent ?from ?to)
			(at_robot ?r ?from) 
			(free ?r)
		)

		:effect (and
			(at_robot ?r ?to)
			(not (at_robot ?r ?from))
		)
	)

	; Moves a robot keeping an empty box between two locations, if it is not already there
	(:action move_empty_robot
		:parameters (?r - robotic_agent ?b - box ?from ?to - location)
		:precondition (and
			(not (= ?from ?to))
			(adjacent ?from ?to)
			(at_robot ?r ?from)
			(occupied ?r ?b)
			(at_box ?b ?from)
			(loaded ?b ?r)
			(empty ?b)
		)

		:effect (and
			(at_robot ?r ?to)
			(not (at_robot ?r ?from))
			(at_box ?b ?to)
			(not (at_box ?b ?from))
		)
	)

	; Moves an occupied robot between two locations, if it is not already there
	(:action move_occupied_robot
		:parameters (?r - robotic_agent ?b - box ?s - supply ?from ?to - location)
		:precondition (and
			(not (= ?from ?to))
			(adjacent ?from ?to)
			(at_robot ?r ?from)
			(occupied ?r ?b)
			(at_box ?b ?from)
			(loaded ?b ?r)
			(full ?b ?s)
			(at_supply ?s ?from)
		)

		:effect (and
			(at_robot ?r ?to)
			(not (at_robot ?r ?from))
			(at_box ?b ?to)
			(not (at_box ?b ?from))
			(at_supply ?s ?to)
			(not (at_supply ?s ?from))
		)
	)

	; Robot picks up a specific unloaded box
	(:action occupy_robot
		:parameters (?r - robotic_agent ?b - box ?l - location)
		:precondition (and
			(at_robot ?r ?l)
			(free ?r)
			(at_box ?b ?l)
			(unloaded ?b)
		)

		:effect (and
			(occupied ?r ?b)
			(not(free ?r))
			(loaded ?b ?r)
			(not (unloaded ?b))
		)
	)

	; Robot puts down the loaded box
	(:action free_robot
		:parameters (?r - robotic_agent ?b - box ?l - location)
		:precondition (and
			(at_robot ?r ?l) 
			(occupied ?r ?b)
			(at_box ?b ?l)
			(loaded ?b ?r)
		)
	
		:effect (and
			(free ?r)
			(not (occupied ?r ?b))
			(unloaded ?b)
			(not (loaded ?b ?r))
		)
	)

	; Fill a box with a specific supply
	(:action fill_box
		:parameters (?r - robotic_agent ?b - box ?s - supply)
		:precondition (and
			(at_robot ?r warehouse)
			(at_box ?b warehouse)
			(at_supply ?s warehouse)
			(occupied ?r ?b)
			(loaded ?b ?r)
			(empty ?b)
		)

		:effect (and
			(full ?b ?s)
			(not (empty ?b))
		)
	)

	; ; Empty a box containing a specific supply
	(:action empty_box
		:parameters (?r - robotic_agent ?b - box ?s - supply ?l - location)
		:precondition (and
			(at_robot ?r ?l)
			(at_box ?b ?l)
			(at_supply ?s ?l)
			(occupied ?r ?b)
			(loaded ?b ?r)
			(full ?b ?s)
		)	

		:effect (and
			(empty ?b)
			(not (full ?b ?s))
		)
	)

	; Delivery a specific supply to a specific work station
	(:action deliver_supply
		:parameters (?r - robotic_agent ?b - box ?s - supply ?ws - work_station ?l - location)
		:precondition (and
			(not (delivered ?ws ?s))
			(belong ?ws ?l)
			(at_robot ?r ?l)
			(at_box ?b ?l)
			(at_supply ?s ?l)
			(occupied ?r ?b)
			(loaded ?b ?r)
			(full ?b ?s)
			(or
				(and (is_durable ?s) (dissociate ?s))
				(not (is_durable ?s))	
			)
		)

		:effect (and
			(delivered ?s ?ws)
			(empty ?b)
			(not (full ?b ?s))
			(at_supply ?s ?l)
			(when
				(is_durable ?s)
				
				(and 
					(assigned ?s ?ws)
					(not (dissociate ?s))
				)
			)
		)
	)

	; Some specific supplies are durable (or not consumable)
	; this means that their usage must be shared among the different work stations
	; beacuse of that we need to dissociate them from the work station that uses them
	; meaning that the robot can recover the supply from the work station and
	; bring it back to the warehouse or to another work station
	(:action release_supply
		:parameters (?r - robotic_agent ?b - box ?d - durable ?ws - work_station ?l - location)
		:precondition (and
			(belong ?ws ?l)
			(at_robot ?r ?l)
			(at_box ?b ?l)
			(at_supply ?d ?l)
			(assigned ?d ?ws)
			(occupied ?r ?b)
			(loaded ?b ?r)
			(empty ?b)
		)

		:effect (and
			(full ?b ?d)
			(not (empty ?b))
			(not (assigned ?s ?ws))
			(dissociate ?d)
		)
	)	
)

; problem
(define (problem industrial_manufacturing)
	(:domain industrial_manufacturing)

	(:objects 
		location1 location2 location3 location4 - location
		work_station1 work_station2 work_station3 work_station4 work_station5 work_station6 work_station7 - work_station

		box1 - box	; at this stage of the project one box is enough, because we have just one robot and we assume the action of loading and unloading is instantaneous
		valve1 valve2 valve3 - valve
		bolt1 bolt2 bolt3 - bolt
		tool1 tool2 - tool

		robot1 - robotic_agent
	)

	(:init
		; locations
		(adjacent warehouse location1)
		(adjacent warehouse location2)
		(adjacent warehouse location3)
		(adjacent warehouse location4)

		(adjacent location1 warehouse)
		(adjacent location2 warehouse)
		(adjacent location3 warehouse)
		(adjacent location4 warehouse)

		; work stations
		(belong work_station1 location1)
		(belong work_station2 location1)
		(belong work_station3 location2)
		(belong work_station4 location3)
		(belong work_station5 location3)
		(belong work_station6 location4)
		(belong work_station7 location4)

		; boxes
		(empty box1)
		(unloaded box1)
		(at_box box1 warehouse)

		; robots
		(free robot1)
		(at_robot robot1 warehouse)

		; supplies
		(at_supply valve1 warehouse)
		(at_supply valve2 warehouse)
		(at_supply valve3 warehouse)
	
		(at_supply bolt1 warehouse)
		(at_supply bolt2 warehouse)
		(at_supply bolt3 warehouse)

		(at_supply tool1 warehouse)
		(is_durable tool1)
		(dissociate tool1)

		(at_supply tool2 warehouse)
		(is_durable tool2)
		(dissociate tool2)
	)

	(:goal (and
		(and
			(exists (?v - valve) (delivered ?v work_station1))
			(exists (?b - bolt) (delivered ?b work_station1))		
			(exists (?t - tool) (delivered ?t work_station1))
		)

		(and
			(exists (?b - bolt) (delivered ?b work_station5))		
			(exists (?t - tool) (delivered ?t work_station5))
		)

		(exists (?b - bolt) (delivered ?b work_station3))
		(exists (?v - valve) (delivered ?v work_station6))
		(exists (?t - tool) (delivered ?t work_station7))
	
		(forall (?t - tool) 
			(and 
				(dissociate ?t)
			)
		)
			
		(forall (?r - robotic_agent) 
			(and 
				(free ?r)
				(at_robot ?r warehouse)
			)
		)

		(forall (?b - box) 
			(and
				(empty ?b)
				(unloaded ?b)
				(at_box ?b warehouse)
			)
		)
	))
)

; plan
1. (occupy_robot robot1 box1 warehouse)
   deleted: (free robot1) (unloaded box1)
   added: (occupied robot1 box1) (loaded box1 robot1)
   goals met: 1 of 8
2. (fill_box robot1 box1 bolt3)
   deleted: (empty box1)
   added: (full box1 bolt3)
   goals met: 1 of 8
3. (move_occupied_robot robot1 box1 bolt3 warehouse location2)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply bolt3 warehouse)
   added: (at_robot robot1 location2) (at_box box1 location2) (at_supply bolt3 location2)
   goals met: 1 of 8
4. (deliver_supply robot1 box1 bolt3 work_station3 location2)
   deleted: (full box1 bolt3)
   added: (delivered bolt3 work_station3) (empty box1)
   goals met: 2 of 8
5. (move_empty_robot robot1 box1 location2 warehouse)
   deleted: (at_robot robot1 location2) (at_box box1 location2)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse)
   goals met: 2 of 8
6. (fill_box robot1 box1 bolt1)
   deleted: (empty box1)
   added: (full box1 bolt1)
   goals met: 2 of 8
7. (move_occupied_robot robot1 box1 bolt1 warehouse location1)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply bolt1 warehouse)
   added: (at_robot robot1 location1) (at_box box1 location1) (at_supply bolt1 location1)
   goals met: 2 of 8
8. (deliver_supply robot1 box1 bolt1 work_station1 location1)
   deleted: (full box1 bolt1)
   added: (delivered bolt1 work_station1) (empty box1)
   goals met: 2 of 8
9. (move_empty_robot robot1 box1 location1 warehouse)
   deleted: (at_robot robot1 location1) (at_box box1 location1)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse)
   goals met: 2 of 8
10. (fill_box robot1 box1 tool1)
   deleted: (empty box1)
   added: (full box1 tool1)
   goals met: 2 of 8
11. (move_occupied_robot robot1 box1 tool1 warehouse location3)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply tool1 warehouse)
   added: (at_robot robot1 location3) (at_box box1 location3) (at_supply tool1 location3)
   goals met: 2 of 8
12. (deliver_supply robot1 box1 tool1 work_station5 location3)
   deleted: (full box1 tool1) (dissociate tool1)
   added: (delivered tool1 work_station5) (empty box1) (assigned tool1 work_station5)
   goals met: 1 of 8
13. (release_supply robot1 box1 tool1 work_station5 location3)
   deleted: (empty box1)
   added: (full box1 tool1) (dissociate tool1)
   goals met: 2 of 8
14. (move_occupied_robot robot1 box1 tool1 location3 warehouse)
   deleted: (at_robot robot1 location3) (at_box box1 location3) (at_supply tool1 location3)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply tool1 warehouse)
   goals met: 2 of 8
15. (empty_box robot1 box1 tool1 warehouse)
   deleted: (full box1 tool1)
   added: (empty box1)
   goals met: 2 of 8
16. (fill_box robot1 box1 valve1)
   deleted: (empty box1)
   added: (full box1 valve1)
   goals met: 2 of 8
17. (move_occupied_robot robot1 box1 valve1 warehouse location1)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply valve1 warehouse)
   added: (at_robot robot1 location1) (at_box box1 location1) (at_supply valve1 location1)
   goals met: 2 of 8
18. (deliver_supply robot1 box1 valve1 work_station1 location1)
   deleted: (full box1 valve1)
   added: (delivered valve1 work_station1) (empty box1)
   goals met: 2 of 8
19. (move_empty_robot robot1 box1 location1 warehouse)
   deleted: (at_robot robot1 location1) (at_box box1 location1)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse)
   goals met: 2 of 8
20. (fill_box robot1 box1 tool1)
   deleted: (empty box1)
   added: (full box1 tool1)
   goals met: 2 of 8
21. (move_occupied_robot robot1 box1 tool1 warehouse location1)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply tool1 warehouse)
   added: (at_robot robot1 location1) (at_box box1 location1) (at_supply tool1 location1)
   goals met: 2 of 8
22. (deliver_supply robot1 box1 tool1 work_station1 location1)
   deleted: (full box1 tool1) (dissociate tool1)
   added: (delivered tool1 work_station1) (empty box1) (assigned tool1 work_station1)
   goals met: 2 of 8
23. (move_empty_robot robot1 box1 location1 warehouse)
   deleted: (at_robot robot1 location1) (at_box box1 location1)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse)
   goals met: 2 of 8
24. (fill_box robot1 box1 valve3)
   deleted: (empty box1)
   added: (full box1 valve3)
   goals met: 2 of 8
25. (move_occupied_robot robot1 box1 valve3 warehouse location4)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply valve3 warehouse)
   added: (at_robot robot1 location4) (at_box box1 location4) (at_supply valve3 location4)
   goals met: 2 of 8
26. (deliver_supply robot1 box1 valve3 work_station6 location4)
   deleted: (full box1 valve3)
   added: (delivered valve3 work_station6) (empty box1)
   goals met: 3 of 8
27. (move_empty_robot robot1 box1 location4 warehouse)
   deleted: (at_robot robot1 location4) (at_box box1 location4)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse)
   goals met: 3 of 8
28. (fill_box robot1 box1 bolt2)
   deleted: (empty box1)
   added: (full box1 bolt2)
   goals met: 3 of 8
29. (move_occupied_robot robot1 box1 bolt2 warehouse location3)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply bolt2 warehouse)
   added: (at_robot robot1 location3) (at_box box1 location3) (at_supply bolt2 location3)
   goals met: 3 of 8
30. (deliver_supply robot1 box1 bolt2 work_station5 location3)
   deleted: (full box1 bolt2)
   added: (delivered bolt2 work_station5) (empty box1)
   goals met: 4 of 8
31. (move_empty_robot robot1 box1 location3 warehouse)
   deleted: (at_robot robot1 location3) (at_box box1 location3)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse)
   goals met: 4 of 8
32. (fill_box robot1 box1 tool2)
   deleted: (empty box1)
   added: (full box1 tool2)
   goals met: 4 of 8
33. (move_occupied_robot robot1 box1 tool2 warehouse location4)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply tool2 warehouse)
   added: (at_robot robot1 location4) (at_box box1 location4) (at_supply tool2 location4)
   goals met: 4 of 8
34. (deliver_supply robot1 box1 tool2 work_station7 location4)
   deleted: (full box1 tool2) (dissociate tool2)
   added: (delivered tool2 work_station7) (empty box1) (assigned tool2 work_station7)
   goals met: 5 of 8
35. (release_supply robot1 box1 tool2 work_station7 location4)
   deleted: (empty box1)
   added: (full box1 tool2) (dissociate tool2)
   goals met: 5 of 8
36. (move_occupied_robot robot1 box1 tool2 location4 warehouse)
   deleted: (at_robot robot1 location4) (at_box box1 location4) (at_supply tool2 location4)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply tool2 warehouse)
   goals met: 5 of 8
37. (empty_box robot1 box1 tool2 warehouse)
   deleted: (full box1 tool2)
   added: (empty box1)
   goals met: 5 of 8
38. (move_empty_robot robot1 box1 warehouse location1)
   deleted: (at_robot robot1 warehouse) (at_box box1 warehouse)
   added: (at_robot robot1 location1) (at_box box1 location1)
   goals met: 5 of 8
39. (release_supply robot1 box1 tool1 work_station1 location1)
   deleted: (empty box1)
   added: (full box1 tool1) (dissociate tool1)
   goals met: 6 of 8
40. (move_occupied_robot robot1 box1 tool1 location1 warehouse)
   deleted: (at_robot robot1 location1) (at_box box1 location1) (at_supply tool1 location1)
   added: (at_robot robot1 warehouse) (at_box box1 warehouse) (at_supply tool1 warehouse)
   goals met: 6 of 8
41. (empty_box robot1 box1 tool1 warehouse)
   deleted: (full box1 tool1)
   added: (empty box1)
   goals met: 6 of 8
42. (free_robot robot1 box1 warehouse)
   deleted: (occupied robot1 box1) (loaded box1 robot1)
   added: (free robot1) (unloaded box1)
   goals met: 8 of 8
